{"cells":[{"cell_type":"code","execution_count":null,"id":"5e7f079e","metadata":{"id":"5e7f079e"},"outputs":[],"source":["import pandas as pd\n","import numpy as np\n","from neo4j import GraphDatabase\n","from neo4j.exceptions import ServiceUnavailable\n","import re"]},{"cell_type":"markdown","id":"f9a92641","metadata":{"id":"f9a92641"},"source":["Scoring based on traveller volume"]},{"cell_type":"code","execution_count":null,"id":"f2310d63","metadata":{"id":"f2310d63"},"outputs":[],"source":["# Replace with the actual URI, username and password\n","AURA_CONNECTION_URI = \"neo4j+s://85b099f8.databases.neo4j.io:7687\"\n","AURA_USERNAME = \"neo4j\"\n","AURA_PASSWORD = \"password\"\n","\n","# Driver instantiation\n","driver = GraphDatabase.driver(\n","    AURA_CONNECTION_URI,\n","    auth=(AURA_USERNAME, AURA_PASSWORD)\n",")\n","#85b099f8.databases.neo4j.io:7687"]},{"cell_type":"code","execution_count":null,"id":"aa6ea81f","metadata":{"id":"aa6ea81f","outputId":"ef622f52-9420-4bab-dd1e-6197037d8121"},"outputs":[{"name":"stdout","output_type":"stream","text":["MATCH (c1)-[r:travel_to]->(c2 {code :'SG'})RETURN max(r.visitors), min(r.visitors)\n"]}],"source":["#calculate the total visitor volume of this dataset\n","query = (\n","        \"MATCH (c1)-[r:travel_to]->(c2 {code :'SG'})\"\n","        \"RETURN max(r.visitors), min(r.visitors)\"\n","        )\n","with driver.session() as session:\n","    results = session.run(query)\n","    for result in results:\n","        print(query)\n","                    \n","        maxvisitors=result['max(r.visitors)']\n","        minvisitors=result['min(r.visitors)']"]},{"cell_type":"code","execution_count":null,"id":"083a9dda","metadata":{"id":"083a9dda","outputId":"dcbfeeec-878e-40a3-acaf-6b57184fd995"},"outputs":[{"name":"stdout","output_type":"stream","text":["3627030\n","5182\n"]}],"source":["  print(maxvisitors)\n","  print(minvisitors)"]},{"cell_type":"code","execution_count":null,"id":"00d4f6e0","metadata":{"id":"00d4f6e0"},"outputs":[],"source":["def onehop(country):\n","    try:\n","        query = (\n","                \"MATCH (c1 {code :'\" \n","                f\"{country}\"\n","                \"'})-[r:travel_to]-> (c2 {code :'SG'})\"\n","                \"RETURN c1, c2, r\"\n","                )\n","        with driver.session() as session:\n","                results = session.run(query)\n","                for result in results:\n","                    print(query)\n","\n","                    onehop_results=(result['r']['visitors']-minvisitors)/(maxvisitors-minvisitors)\n","                    return onehop_results\n","\n","        \n","    except:\n","        pass"]},{"cell_type":"code","execution_count":null,"id":"a0f68578","metadata":{"id":"a0f68578"},"outputs":[],"source":["  def twohop(country):\n","      try:\n","\n","          query = (\n","              \"MATCH (c1 {code :'\" \n","              f\"{country}\"\n","              \"'})-[r1:travel_to]->(c2)-[r2:travel_to]-> (c3 {code :'SG'})\"\n","              \"RETURN c1, c2, r1, r2, c3\"\n","                  )\n","          with driver.session() as session:\n","                  results = session.run(query)\n","                  for result in results:\n","                      first_hop=result['r1']['visitors']\n","                      second_hop=result['r2']['visitors']\n","                      twohop_results=((first_hop+second_hop)-(minvisitors*2))/((maxvisitors-minvisitors)*2)\n","                      return twohop_results\n","          \n","      except:\n","          pass"]},{"cell_type":"code","execution_count":null,"id":"c9038afd","metadata":{"id":"c9038afd","outputId":"9591fd7c-27a9-4fb7-dff9-8568937f766b"},"outputs":[{"name":"stdout","output_type":"stream","text":["please carry on\n","please carry on\n","contains SG\n"]}],"source":["country_list=[['US'],['US','FR'],['VN','SG']]\n","Singapore=['SG']\n","for country in country_list:\n","    match_code=[w for w in Singapore if w in country]\n","    if len(match_code)>0:\n","        print('contains SG')\n","    else:\n","        print('please carry on')"]},{"cell_type":"code","execution_count":null,"id":"b201ad29","metadata":{"id":"b201ad29","outputId":"1dbfb9b9-dc1d-48fe-b673-f50c32727b36"},"outputs":[{"name":"stdout","output_type":"stream","text":["MATCH (c1 {code :'US'})-[r:travel_to]-> (c2 {code :'SG'})RETURN c1, c2, r\n","0.19991948861465197\n","0.009196134128213001\n","0.10455781137143248\n","MATCH (c1 {code :'US'})-[r:travel_to]-> (c2 {code :'SG'})RETURN c1, c2, r\n","0.19991948861465197\n","0.009196134128213001\n","[0.20911562274286496]\n","0.20911562274286496\n","MATCH (c1 {code :'FR'})-[r:travel_to]-> (c2 {code :'SG'})RETURN c1, c2, r\n","0.0573188052066238\n","0.008782809217835757\n","[0.20911562274286496, 0.06610161442445955]\n","0.20911562274286496\n","1\n","MATCH (c1 {code :'BN'})-[r:travel_to]-> (c2 {code :'SG'})RETURN c1, c2, r\n","0.018615082687070246\n","0.43062685126487915\n","0.2246209669759747\n"]}],"source":["country_list=[['US'],['US','FR'],['SG','VN'],['BN']]\n","Singapore=['SG']\n","for country in country_list:\n","    match_code=[w for w in Singapore if w in country]\n","    if len(match_code)>0:\n","        print('1')\n","    else:\n","        if len(country)==1:\n","            for code in country:\n","                onehop_dist=onehop(code)\n","                print(onehop_dist)\n","                twohop_dist=twohop(code)\n","                print(twohop_dist)\n","                consolidate_visitor=(onehop_dist+twohop_dist)/2\n","                print(consolidate_visitor)\n","        else:\n","            consolidate_visitors=[]\n","            for code in country:\n","                onehop_dist=onehop(code)\n","                print(onehop_dist)\n","                twohop_dist=twohop(code)\n","                print(twohop_dist)\n","                consolidate_visitors.append(onehop_dist+twohop_dist)\n","                print(consolidate_visitors)\n","                consolidate_visitor=max(consolidate_visitors)\n","                print(consolidate_visitor)"]},{"cell_type":"code","execution_count":null,"id":"8e75327b","metadata":{"id":"8e75327b","outputId":"0aa9ff19-cd52-49f7-d259-642f0dfd137d"},"outputs":[{"name":"stdout","output_type":"stream","text":["MATCH (c1 {code :'US'})-[r:travel_to]-> (c2 {code :'SG'})RETURN c1, c2, r\n","0.19991948861465197\n","0.009196134128213001\n","0.10455781137143248\n","[0.10455781137143248]\n","None\n","None\n","MATCH (c1 {code :'FR'})-[r:travel_to]-> (c2 {code :'SG'})RETURN c1, c2, r\n","0.0573188052066238\n","0.008782809217835757\n","[0, 0.03305080721222978]\n","0.03305080721222978\n","[0.10455781137143248, 0.03305080721222978]\n","1\n","MATCH (c1 {code :'BN'})-[r:travel_to]-> (c2 {code :'SG'})RETURN c1, c2, r\n","0.018615082687070246\n","0.43062685126487915\n","[0.2246209669759747]\n","0.2246209669759747\n","MATCH (c1 {code :'VN'})-[r:travel_to]-> (c2 {code :'SG'})RETURN c1, c2, r\n","0.16200182890060544\n","0.009357515831696969\n","[0.2246209669759747, 0.0856796723661512]\n","0.2246209669759747\n","[0.10455781137143248, 0.03305080721222978, 2, 0.2246209669759747]\n"]}],"source":["country_list=[['US'],['Pacific','FR'],['SG','VN'],['BN','VN']]\n","Singapore=['SG']\n","consolidate_list=[]\n","for country in country_list:\n","    match_code=[w for w in Singapore if w in country]\n","    if len(match_code)>0:\n","        print('1')\n","        consolidate_list.append(2)\n","    else:\n","        if len(country)==1:\n","            for code in country:\n","                onehop_dist=onehop(code)\n","                print(onehop_dist)\n","                twohop_dist=twohop(code)\n","                print(twohop_dist)\n","                consolidate_visitor=(onehop_dist+twohop_dist)/2\n","                print(consolidate_visitor)\n","                consolidate_list.append(consolidate_visitor)\n","                print(consolidate_list)\n","        else:\n","            consolidate_visitors=[]\n","            for code in country:\n","                onehop_dist=onehop(code)\n","                print(onehop_dist)\n","                twohop_dist=twohop(code)\n","                print(twohop_dist)\n","                if onehop_dist is None or twohop_dist is None:\n","                    consolidate_visitors.append(0)\n","                else:\n","                    consolidate_visitors.append((onehop_dist+twohop_dist)/2)\n","                    print(consolidate_visitors)\n","                    consolidate_visitor=max(consolidate_visitors)\n","                    print(consolidate_visitor)\n","            consolidate_list.append(consolidate_visitor) \n","            print(consolidate_list)"]},{"cell_type":"code","execution_count":null,"id":"917584ab","metadata":{"id":"917584ab","outputId":"2b282c0c-2a64-4c79-d3b9-b8d3aa2caf67"},"outputs":[{"data":{"text/plain":["[0.10455781137143248, 0.03305080721222978, 2, 0.2246209669759747]"]},"execution_count":93,"metadata":{},"output_type":"execute_result"}],"source":["consolidate_list"]},{"cell_type":"code","execution_count":null,"id":"c4994f0a","metadata":{"id":"c4994f0a","outputId":"4951cd35-7829-4b19-d18b-6c40ee43d6ab"},"outputs":[{"name":"stdout","output_type":"stream","text":["The number of visitors from US to SG is 729260 for one hop.\n","The number of visitors from FR to SG is 212782 for one hop.\n","The number of visitors from VN to SG is 591928 for one hop.\n","The number of visitors from BN to SG is 72603 for one hop.\n","The number of visitors from VN to SG is 591928 for one hop.\n"]}],"source":["onehop=[]\n","for country in country_list:\n","\n","    for codes in country:\n","        query = (\n","                \"MATCH (c1 {code :'\" \n","                f\"{codes}\"\n","                \"'})-[r:travel_to]-> (c2 {code :'SG'})\"\n","                \"RETURN c1, c2, r\"\n","                )\n","        with driver.session() as session:\n","            results = session.run(query)\n","            for result in results:\n","                onehop.append(result['r']['visitors'])\n","                print(\"The number of visitors from {0} to {2} is {1} for one hop.\".format(result['c1']['code'], \n","                                                                           result['r']['visitors'], \n","                                                                           result['c2']['code']))"]},{"cell_type":"code","execution_count":null,"id":"bf49cedf","metadata":{"id":"bf49cedf","outputId":"9dd71c81-1634-414c-97cb-7cde85b708a0"},"outputs":[{"name":"stdout","output_type":"stream","text":["The number of visitors from US to BN is 4375. The number of visitors from BN to SG is 72603\n","The number of visitors from US to ID is 457832. The number of visitors from ID to SG is 3110416\n","The number of visitors from US to MY is 269928. The number of visitors from MY to SG is 1220664\n","The number of visitors from US to MM is 66757. The number of visitors from MM to SG is 155985\n","The number of visitors from US to PH is 1064440. The number of visitors from PH to SG is 829304\n","The number of visitors from US to TH is 1165856. The number of visitors from TH to SG is 528486\n","The number of visitors from US to VN is 746171. The number of visitors from VN to SG is 591928\n","The number of visitors from US to BN is 4375. The number of visitors from BN to SG is 72603\n","The number of visitors from US to ID is 457832. The number of visitors from ID to SG is 3110416\n","The number of visitors from US to MY is 269928. The number of visitors from MY to SG is 1220664\n","The number of visitors from US to MM is 66757. The number of visitors from MM to SG is 155985\n","The number of visitors from US to PH is 1064440. The number of visitors from PH to SG is 829304\n","The number of visitors from US to TH is 1165856. The number of visitors from TH to SG is 528486\n","The number of visitors from US to VN is 746171. The number of visitors from VN to SG is 591928\n","The number of visitors from FR to BN is 1381. The number of visitors from BN to SG is 72603\n","The number of visitors from FR to ID is 283814. The number of visitors from ID to SG is 3110416\n","The number of visitors from FR to MY is 141661. The number of visitors from MY to SG is 1220664\n","The number of visitors from FR to MM is 42608. The number of visitors from MM to SG is 155985\n","The number of visitors from FR to PH is 88577. The number of visitors from PH to SG is 829304\n","The number of visitors from FR to TH is 745318. The number of visitors from TH to SG is 528486\n","The number of visitors from FR to VN is 287655. The number of visitors from VN to SG is 591928\n","The number of visitors from SG to BN is 14789. The number of visitors from BN to SG is 72603\n","The number of visitors from SG to ID is 1934445. The number of visitors from ID to SG is 3110416\n","The number of visitors from SG to MY is 10163882. The number of visitors from MY to SG is 1220664\n","The number of visitors from SG to MM is 57890. The number of visitors from MM to SG is 155985\n","The number of visitors from SG to PH is 158595. The number of visitors from PH to SG is 829304\n","The number of visitors from SG to TH is 1056582. The number of visitors from TH to SG is 528486\n","The number of visitors from SG to VN is 308969. The number of visitors from VN to SG is 591928\n","The number of visitors from US to BN is 4375. The number of visitors from BN to SG is 72603\n","The number of visitors from US to ID is 457832. The number of visitors from ID to SG is 3110416\n","The number of visitors from US to MY is 269928. The number of visitors from MY to SG is 1220664\n","The number of visitors from US to MM is 66757. The number of visitors from MM to SG is 155985\n","The number of visitors from US to PH is 1064440. The number of visitors from PH to SG is 829304\n","The number of visitors from US to TH is 1165856. The number of visitors from TH to SG is 528486\n","The number of visitors from US to VN is 746171. The number of visitors from VN to SG is 591928\n","The number of visitors from VN to BN is 5544. The number of visitors from BN to SG is 72603\n","The number of visitors from VN to ID is 96024. The number of visitors from ID to SG is 3110416\n","The number of visitors from VN to MY is 400346. The number of visitors from MY to SG is 1220664\n","The number of visitors from VN to MM is 52567. The number of visitors from MM to SG is 155985\n","The number of visitors from VN to PH is 66698. The number of visitors from PH to SG is 829304\n","The number of visitors from VN to TH is 1047663. The number of visitors from TH to SG is 528486\n"]}],"source":["country_list=[['US'],['US','FR'],['SG','US','VN']]\n","twohop=[]\n","for country in country_list:\n","    for codes in country:\n","        try:\n","        \n","            query = (\n","                \"MATCH (c1 {code :'\" \n","                f\"{codes}\"\n","                \"'})-[r1:travel_to]->(c2)-[r2:travel_to]-> (c3 {code :'SG'})\"\n","                \"RETURN c1, c2, r1, r2, c3\"\n","                        )\n","            with driver.session() as session:\n","                results = session.run(query)\n","                for result in results:\n","                    first_hop=result['r1']['visitors']\n","                    second_hop=result['r2']['visitors']\n","                    each_twohop=first_hop+second_hop\n","                    twohop.append(each_twohop)\n","                    print(\"The number of visitors from {0} to {2} is {1}. The number of visitors from {2} to {4} is {3}\".format(result['c1']['code'], \n","                                                                   result['r1']['visitors'], \n","                                                                   result['c2']['code'],\n","                                                                    result['r2']['visitors'],\n","                                                                    result['c3']['code']))\n","            \n","\n","            \n","\n","        except:\n","            pass\n"]},{"cell_type":"markdown","id":"efcc5ca8","metadata":{"id":"efcc5ca8"},"source":["Now Deal with Map Distance\n","http://techslides.com/list-of-countries-and-capitals#google_vignette"]},{"cell_type":"code","execution_count":null,"id":"30b15a08","metadata":{"id":"30b15a08"},"outputs":[],"source":["import math\n","# Use this method to reduce dependencies as much as possible\n","def distance(origin, destination):\n","    lat1, lon1 = origin\n","    lat2, lon2 = destination\n","    radius = 6371  # km\n","\n","    dlat = math.radians(lat2 - lat1)\n","    dlon = math.radians(lon2 - lon1)\n","    a = (math.sin(dlat / 2) * math.sin(dlat / 2) +\n","         math.cos(math.radians(lat1)) * math.cos(math.radians(lat2)) *\n","         math.sin(dlon / 2) * math.sin(dlon / 2))\n","    c = 2 * math.atan2(math.sqrt(a), math.sqrt(1 - a))\n","    d = radius * c\n","\n","    return d\n","\n","\n","if __name__ == '__main__':\n","    import doctest\n","    doctest.testmod()"]},{"cell_type":"code","execution_count":null,"id":"2eade203","metadata":{"id":"2eade203","outputId":"22a4cdcb-8b24-4df6-e48a-5dd8ceb700fe"},"outputs":[{"data":{"text/plain":["0.00254961085185845"]},"execution_count":15,"metadata":{},"output_type":"execute_result"}],"source":["lyon = (45.7597, 4.8422) # (latitude, longitude)\n","paris = (48.8567, 2.3508)\n","test=1/distance(lyon, paris)\n","test"]},{"cell_type":"code","execution_count":null,"id":"f43bb93a","metadata":{"id":"f43bb93a","outputId":"8120165f-abae-41cc-9c1c-ee5fd8617851"},"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>CountryName</th>\n","      <th>CapitalName</th>\n","      <th>CapitalLatitude</th>\n","      <th>CapitalLongitude</th>\n","      <th>CountryCode</th>\n","      <th>ContinentName</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Somaliland</td>\n","      <td>Hargeisa</td>\n","      <td>9.550000</td>\n","      <td>44.050000</td>\n","      <td>SO</td>\n","      <td>Africa</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>South Georgia and South Sandwich Islands</td>\n","      <td>King Edward Point</td>\n","      <td>-54.283333</td>\n","      <td>-36.500000</td>\n","      <td>GS</td>\n","      <td>Antarctica</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>French Southern and Antarctic Lands</td>\n","      <td>Port-aux-Français</td>\n","      <td>-49.350000</td>\n","      <td>70.216667</td>\n","      <td>TF</td>\n","      <td>Antarctica</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Palestine</td>\n","      <td>Jerusalem</td>\n","      <td>31.766667</td>\n","      <td>35.233333</td>\n","      <td>PS</td>\n","      <td>Asia</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Aland Islands</td>\n","      <td>Mariehamn</td>\n","      <td>60.116667</td>\n","      <td>19.900000</td>\n","      <td>AX</td>\n","      <td>Europe</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                                CountryName        CapitalName  \\\n","0                                Somaliland           Hargeisa   \n","1  South Georgia and South Sandwich Islands  King Edward Point   \n","2       French Southern and Antarctic Lands  Port-aux-Français   \n","3                                 Palestine          Jerusalem   \n","4                             Aland Islands          Mariehamn   \n","\n","   CapitalLatitude  CapitalLongitude CountryCode ContinentName  \n","0         9.550000         44.050000          SO        Africa  \n","1       -54.283333        -36.500000          GS    Antarctica  \n","2       -49.350000         70.216667          TF    Antarctica  \n","3        31.766667         35.233333          PS          Asia  \n","4        60.116667         19.900000          AX        Europe  "]},"execution_count":16,"metadata":{},"output_type":"execute_result"}],"source":["country_map_df = pd.read_csv(\"country-capitals.csv\")\n","country_map_df.head()"]},{"cell_type":"code","execution_count":null,"id":"01457871","metadata":{"id":"01457871","outputId":"cacd00ce-dec7-4deb-84ac-dd3e54cc001d"},"outputs":[{"data":{"text/plain":["[(1.283333333, 103.85)]"]},"execution_count":17,"metadata":{},"output_type":"execute_result"}],"source":["#take out Singapore's coordinates first, since it will always be the destination\n","singapore_coordinates=list(zip(country_map_df[country_map_df['CountryCode']=='SG'].CapitalLatitude,country_map_df[country_map_df['CountryCode']=='SG'].CapitalLongitude))\n","singapore_coordinates"]},{"cell_type":"code","execution_count":null,"id":"63293649","metadata":{"id":"63293649","outputId":"a1ab1335-24bf-4a25-a64a-107fac5fd0fc"},"outputs":[{"data":{"text/plain":["0                 (9.55, 44.05)\n","1           (-54.283333, -36.5)\n","2           (-49.35, 70.216667)\n","3      (31.76666667, 35.233333)\n","4             (60.116667, 19.9)\n","                 ...           \n","239                  (0.0, 0.0)\n","240                  (0.0, 0.0)\n","241                  (0.0, 0.0)\n","242                (-7.3, 72.4)\n","243                  (0.0, 0.0)\n","Name: map_coordinates, Length: 244, dtype: object"]},"execution_count":18,"metadata":{},"output_type":"execute_result"}],"source":["country_map_df['map_coordinates'] = list(zip(country_map_df.CapitalLatitude, country_map_df.CapitalLongitude))\n","coordinates=country_map_df['map_coordinates']\n","coordinates"]},{"cell_type":"code","execution_count":null,"id":"a7c34586","metadata":{"id":"a7c34586"},"outputs":[],"source":["impt=[]\n","for coordinate in coordinates:\n","    for singapore_coordinate in singapore_coordinates:\n","        #need to ensure that Singapore is taken out of the equation, cos dividing number by zero will result in error\n","        match_coordinate=[w for w in singapore_coordinate if w in coordinate]\n","        if len(match_coordinate)>0:\n","            #print(1)\n","            pass\n","        else:\n","        #calculation for other coordinates against the coordinates of Singapore\n","            calculation=1/distance(coordinate, singapore_coordinate)\n","            #print(calculation)\n","            impt.append(calculation)"]},{"cell_type":"code","execution_count":null,"id":"81556efd","metadata":{"id":"81556efd","outputId":"4f879537-19b4-4780-911c-47913e21df1e"},"outputs":[{"name":"stdout","output_type":"stream","text":["0.0031478582679599874\n","5.068900510473246e-05\n"]}],"source":["#set the maximum distance and minimum distance based on the data available\n","max_impt=max(impt) #0.0031478582679599874\n","min_impt=min(impt) #5.068900510473246e-05\n","print(max_impt)\n","print(min_impt)"]},{"cell_type":"code","execution_count":null,"id":"d2166274","metadata":{"id":"d2166274"},"outputs":[],"source":["max_impt=0.0031478582679599874\n","min_impt=5.068900510473246e-05"]},{"cell_type":"code","execution_count":null,"id":"4b2adb45","metadata":{"id":"4b2adb45","outputId":"323a501c-3200-4052-af6b-7cfe5a964725"},"outputs":[{"name":"stdout","output_type":"stream","text":["1\n"]}],"source":["consolidate_distance=[]\n","for coordinate in coordinates:\n","    for singapore_coordinate in singapore_coordinates:\n","        #need to ensure that Singapore is taken out of the equation, cos dividing number by zero will result in error\n","        match_coordinate=[w for w in singapore_coordinate if w in coordinate]\n","        if len(match_coordinate)>0:\n","            print(1)\n","            consolidate_distance.append(2)\n","        else:\n","        #calculation for other coordinates against the coordinates of Singapore\n","            calculation=1/distance(coordinate, singapore_coordinate)\n","            normalise= (calculation-min_impt)/(max_impt-min_impt)\n","            #print(calculation)\n","            consolidate_distance.append(normalise)"]},{"cell_type":"code","execution_count":null,"id":"31475572","metadata":{"id":"31475572","outputId":"1f258cbd-90b2-4374-ef1b-eb19d6ec8912"},"outputs":[{"data":{"text/plain":["[0.032009379627084986,\n"," 0.008267249646465318,\n"," 0.033427412846566,\n"," 0.024396338368153334,\n"," 0.017446397204676604,\n"," 0.02965594143963416,\n"," 0.0021568795896605973,\n"," 0.01795784112422141,\n"," 0.009278686698628176,\n"," 0.04627621366857831,\n"," 0.01792676194468553,\n"," 0.013306525982168029,\n"," 0.017433423431949077,\n"," 0.013208436829860032,\n"," 0.01560471185882307,\n"," 0.002172876371075525,\n"," 0.0021498473271544987,\n"," 0.00395078761803382,\n"," 0.027511566284216943,\n"," 0.0012400744350261534,\n"," 0.035626878923865055,\n"," 0.01686968641942711,\n"," 0.030119729965163163,\n"," 0.002537037316795391,\n"," 0.03466171681887887,\n"," 0.09555402689916201,\n"," 0.001989917342714699,\n"," 0.019516145190614315,\n"," 0.014201214444394702,\n"," 0.0020487168241194345,\n"," 0.012380288667759465,\n"," 0.003693465156198146,\n"," 0.08201114577532394,\n"," 0.001462611538616168,\n"," 0.017468803540918034,\n"," 0.02010864889129235,\n"," 0.0031720478896798627,\n"," 0.0020971566328982735,\n"," 0.23317125496966515,\n"," 0.01896700627770336,\n"," 0.011363619716804933,\n"," 0.15178084738718414,\n"," 0.02255221207202926,\n"," 0.26496926587730785,\n"," 0.01511319465031273,\n"," 0.005417154453734599,\n"," 0.006772723660777321,\n"," 0.0019206944740813685,\n"," 0.017721187856852148,\n"," 0.016416324275900472,\n"," 0.0033298252717546923,\n"," 0.05571990656975504,\n"," 0.22874274207420328,\n"," 0.17532151689090203,\n"," 0.00034421604146733813,\n"," 0.03078002145694266,\n"," 0.016387887799629648,\n"," 0.01638234630017713,\n"," 0.013750337740700825,\n"," 0.0010962225310138334,\n"," 0.010319524770013048,\n"," 0.01678803288245803,\n"," 0.002383634274881865,\n"," 0.0012521333793069195,\n"," 0.023201524531935587,\n"," 0.01639935440466954,\n"," 0.016021298812378383,\n"," 0.031183291317919287,\n"," 0.0020214257360227244,\n"," 0.001859788642218926,\n"," 0.0,\n"," 0.022695475444574918,\n"," 0.0017584967573229045,\n"," 0.014208478124067114,\n"," 0.02796370098444844,\n"," 0.01845487868668507,\n"," 0.028125472839135177,\n"," 0.006445196928773839,\n"," 0.013153081912322678,\n"," 0.021957707907629135,\n"," 0.018452606421829935,\n"," 0.01370170804543385,\n"," 0.010977958594655357,\n"," 0.014396378317669968,\n"," 0.008004216870628385,\n"," 0.027319150918952685,\n"," 0.01616609999999991,\n"," 0.011589351003129352,\n"," 0.011389521188136279,\n"," 0.019292954564508073,\n"," 0.009534837809037295,\n"," 0.0017313427019814438,\n"," 0.05236983865323706,\n"," 0.0019341613022607633,\n"," 0.012795101344498424,\n"," 0.008473753019460399,\n"," 0.008150151839798933,\n"," 0.0017477196126854772,\n"," 0.0018010048301683804,\n"," 0.015830900947238127,\n"," 0.001656784321270643,\n"," 0.017587272492183528,\n"," 0.011666598262049802,\n"," 0.061433244990256076,\n"," 0.3458170565060487,\n"," 0.03246370453693737,\n"," 0.028936226140589695,\n"," 0.012444491046343492,\n"," 0.012800038165067185,\n"," 0.024396338368153334,\n"," 0.01583975616910628,\n"," 0.0017020864932665266,\n"," 0.04429576243597738,\n"," 0.012857900502878657,\n"," 0.024713456607903167,\n"," 0.03469330782699273,\n"," 0.026922834855753072,\n"," 0.027820117097656007,\n"," 0.0516221986845272,\n"," 0.052684140482017736,\n"," 0.018303062472010335,\n"," 0.03201081436233613,\n"," 0.042755711303974944,\n"," 0.15721173478456524,\n"," 0.018470810126615368,\n"," 0.024294290626051412,\n"," 0.020489920435762702,\n"," 0.009031169125548822,\n"," 0.015941131194108966,\n"," 0.015194132104413678,\n"," 0.018895308624871748,\n"," 0.014516926647316374,\n"," 0.018404392790870982,\n"," 0.03296008940020425,\n"," 0.02452348878595168,\n"," 1.0,\n"," 0.07899786801276648,\n"," 0.0097963058599034,\n"," 0.01636198576398071,\n"," 0.026619994671914508,\n"," 0.00829310119240579,\n"," 0.041460604633331496,\n"," 0.0030729628585641996,\n"," 0.03699127196912194,\n"," 0.020444831436834808,\n"," 0.01460540036778474,\n"," 0.0457993949433468,\n"," 0.017739660504792157,\n"," 0.002085774293629351,\n"," 0.010961011265587057,\n"," 0.022976567749961114,\n"," 0.016815659428671723,\n"," 0.07483916041744118,\n"," 0.014386096410701137,\n"," 0.02807588482797508,\n"," 0.021506653532199403,\n"," 0.0014207371856461226,\n"," 0.01235608055030692,\n"," 0.013870501624900826,\n"," 0.017063709220383767,\n"," 0.026182249206880455,\n"," 0.050205879446719184,\n"," 0.015739161981229537,\n"," 0.042674682976321626,\n"," 0.05059322502086734,\n"," 0.0764151417283599,\n"," 0.0007940458225892772,\n"," 0.04893259513894119,\n"," 0.0029768727046818643,\n"," 0.0007954103659357608,\n"," 0.11853492812342828,\n"," 0.0072673116982452214,\n"," 0.017951246590733733,\n"," 0.01079838419382095,\n"," 0.0020206062364403516,\n"," 0.03567651029290836,\n"," 0.019759254150265006,\n"," 0.02193551948051459,\n"," 0.022947565954198095,\n"," 0.002153675357242593,\n"," 0.010235583371241409,\n"," 0.0021070965068958796,\n"," 0.0019444791923305595,\n"," 0.006168722271382489,\n"," 0.0018581381288808175,\n"," 0.017852984343128136,\n"," 0.015846322553132397,\n"," 0.013535645695905697,\n"," 0.032147827987393136,\n"," 0.007841093979444876,\n"," 0.0180449541919489,\n"," 0.043239264791343476,\n"," 0.00854868484466359,\n"," 2,\n"," 0.0021545725649373317,\n"," 0.017061433362110048,\n"," 0.01640180122184088,\n"," 0.034683119827397045,\n"," 0.03327454675217943,\n"," 0.02102634871944067,\n"," 0.023856786118531512,\n"," 0.011988265158958044,\n"," 0.10167852216077661,\n"," 0.024148228802025894,\n"," 0.0020265150772950003,\n"," 0.016488514941584747,\n"," 0.02227294724756818,\n"," 0.01710383927560887,\n"," 0.014717549199606718,\n"," 0.024711702073196447,\n"," 0.0829428815936629,\n"," 0.04268390861342246,\n"," 0.028352124215950944,\n"," 0.2088048860909385,\n"," 0.10554594577492202,\n"," 0.011985397380091396,\n"," 0.019030429674744446,\n"," 0.001649329069769546,\n"," 0.015139058245435925,\n"," 0.02251420366347686,\n"," 0.035969256135517186,\n"," 0.002160740590491875,\n"," 0.021975675846142035,\n"," 0.02436004213590226,\n"," 0.020638261166332203,\n"," 0.03831995540488863,\n"," 0.013383347385983861,\n"," 0.004400248701335916,\n"," 0.004138006432997155,\n"," 0.04086274283032177,\n"," 0.0274996702267517,\n"," 0.0012275075189908792,\n"," 0.12994363897140765,\n"," 0.0020723879865087638,\n"," 0.017915817836646194,\n"," 0.03166201174991816,\n"," 0.021614627065567247,\n"," 0.022831792223260743,\n"," 0.004400248701335916,\n"," 0.011595130623426514,\n"," 0.011595130623426514,\n"," 0.011595130623426514,\n"," 0.07289942334756763,\n"," 0.011595130623426514]"]},"execution_count":96,"metadata":{},"output_type":"execute_result"}],"source":["consolidate_distance"]},{"cell_type":"code","execution_count":null,"id":"cd80c98a","metadata":{"id":"cd80c98a"},"outputs":[],"source":["country=country_map_df['CountryCode']"]},{"cell_type":"code","execution_count":null,"id":"4675db23","metadata":{"id":"4675db23"},"outputs":[],"source":["df=pd.DataFrame({\n","    'country': country,\n","    'disance_impt':consolidate_distance\n","})"]},{"cell_type":"code","execution_count":null,"id":"923bdecf","metadata":{"id":"923bdecf","outputId":"69268593-3f92-4557-ab65-71e70e83748e"},"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>country</th>\n","      <th>disance_impt</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>135</th>\n","      <td>MY</td>\n","      <td>1.0</td>\n","    </tr>\n","    <tr>\n","      <th>193</th>\n","      <td>SG</td>\n","      <td>2.0</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["    country  disance_impt\n","135      MY           1.0\n","193      SG           2.0"]},"execution_count":100,"metadata":{},"output_type":"execute_result"}],"source":["df[df['disance_impt']>0.5]"]}],"metadata":{"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.13"},"colab":{"provenance":[]}},"nbformat":4,"nbformat_minor":5}